# 1
a = [1, 2, 3]
print(a)

# 2
b = []
b.append(10)
print(b)

# 3
c = [5, 10, 15]
print(len(c))

# 4
d = ["a", "b", "c"]
print(d[1])

# 5
e = ["Привет", "мир"]
print(e)

# 6
f = [1, 2, 3]
f.append(100)
print(f)

# 7
g = [10, 20, 30, 40]
g.pop()
print(g)

# 8
h = [1, 3, 5, 7, 9]
print(7 in h)

# 9
i = [0] * 5
print(i)

# 10
j = [1, 2, 3, 4, 5]
print(j[0], j[-1])

# 11
k = [1, 2, 3, 4, 5]
k[2] = 99
print(k)

# 12
m = ["яблоко", "банан"]
m.insert(0, "апельсин")
print(m)

# 13
n = [100]
n.clear()
print(n)

# 14
o = ["ok"] * 3
print(o)

# 15
p = [3, 1, 2]

# 1. Создайте список из трёх чисел: 1, 2 и 3. Выведите его на экран.  
# 2. Создайте пустой список. Добавьте в него число 10. Выведите список.  
# 3. Дан список [5, 10, 15]. Выведите его длину.  
# 4. Дан список ['a', 'b', 'c']. Выведите второй элемент списка.  
# 5. Создайте список из двух строк: "привет" и "мир". Объедините их в одну строку через пробел, используя элементы списка.  
# 6. Добавьте число 100 в конец списка [1, 2, 3]. Выведите получившийся список.  
# 7. Удалите последний элемент из списка [10, 20, 30, 40]. Выведите оставшийся список.  
# 8. Проверьте, содержится ли число 7 в списке [1, 3, 5, 7, 9]. Выведите True или False.  
# 9. Создайте список из пяти нулей. Выведите его.  
# 10. Дан список [1, 2, 3, 4, 5]. Выведите первый и последний элементы.  
# 11. Создайте список из чисел от 1 до 5. Измените третий элемент на число 99. Выведите список.  
# 12. Создайте список ['яблоко', 'банан']. Добавьте в начало элемент 'апельсин'. Выведите список.  
# 13. Дан список [100]. Удалите из него единственный элемент. Выведите получившийся (пустой) список.  
# 14. Создайте список из трёх одинаковых слов "ok". Выведите его.  
# 15. Дан список [3, 1, 2]. Создайте его копию, отсортируйте и выведите оба списка.
